Repository: Daniel-KM/Omeka-S-module-UserProfile
Catalog: language/*.po
Languages: fr

source: The module %1$s should be upgraded to version %2$s or later.
fr: Le module %1$s doit être mis à niveau à la version %2$s ou supérieure.

source: User profile
fr: Profil utilisateur

source: To upgrade the config, you should go to the {link}config form{link_end} and submit it manually.
fr: Pour mettre à jour la configuration, vous devez enregistrer le {link}formulaire de configuration{link_end} manuellement.

source: It is now possible to remove values from guest form and to hide them in admin form.
fr: Il est désormais possible de supprimer des valeurs des formulaires ou de les cacher.

source: You should fix the config of the module.
fr: Vous devez corriger la configuration du module.

source: These elements of user profile are invalid: {list}.
fr: Ces éléments du profil utilisateur sont incorrects : {list}.

source: Profile
fr: Profil

source: The key “o:setting” should be an array of user settings.
fr: La clé « o:setting » doit être un tableau de paramètres utilisateur.

source: A value is required for “{key}”.
fr: Une valeur est nécessaire pour « {key} ».

source: Only one value is allowed for “{key}”.
fr: Une seule valeur est possible pour « {key} ».

source: One or more values (“{values}”) are not allowed for “{key}”.
fr: Une ou plusieurs valeurs (« {values} ») ne sont pas autorisées pour « {key} ».

source: The value “{value}” is not allowed for “{key}”.
fr: La valeur « {value} » n’est pas autorisée pour « {key} ».

source: An array of values is required for “{key}”.
fr: Un tableau de valeurs est nécessaire pour « {key} ».

source: List of fields (as xml, json, or ini)
fr: Liste des champs (en xml, json ou ini)

source: List all input elements as xml, json or ini. It is recommended to prepend “userprofile_” to field names.
fr: Lister tous les champs d’entrées en xml, json ou ini. Il est recommandé de préfixer les noms de champ avec « userprofile_ ».

source: User Profile
fr: Profil utilisateur
